# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Insanely fast image printing in your terminal
brew "catimg"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Distributed revision control system
brew "git"
# Official GitLab CI runner
brew "gitlab-runner"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Simple terminal UI for git commands
brew "lazygit"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-meslo-lg-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# AI-powered productivity tool for the command-line
cask "kiro-cli"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "chrisjdavies.grep-panel"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "tobiasalthoff.atom-material-theme"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
